import pandas as pd
import pytest
from pandas import DataFrame


@pytest.fixture
def table_xlsx() -> DataFrame:
    df = pd.DataFrame(
        {
            "Дата операции": pd.to_datetime(
                ["01.12.2021 13:12:18", "02.12.2021 14:41:17", "03.12.2021 14:49:41"], dayfirst=True
            ),
            "Дата платежа": ["01.12.2021", "02.12.2021", "03.12.2021"],
            "Номер карты": ["*7197", "*5091", "*4556"],
            "Сумма операции": [-3499, -4451, -200],
            "Кэшбэк": [34, 44, 2],
            "Категория": ["Местный транспорт", "Супермаркеты", "Дом и ремонт"],
            "Описание": ["Хлеб", "Улыбка радуги", "Перекрёсток"],
            "Сумма операции с округлением": [3499, 4451, 200],
        }
    )
    return df


@pytest.fixture
def period() -> list:
    return ["01.12.2021 05:30:00", "02.12.2021 15:30:00"]
